import * as React from "react";
import styled from "@emotion/styled";
import Layout from "@/layouts/Layout";

const Privacy = () => {
  return (
    <Layout>
      <Section>
        <Container>
          <Title>개인정보처리방침</Title>
          <Content>
            <p>
              모그는 정보주체의 자유와 권리 보호를 위해 「개인정보 보호법」
              및 관계 법령이 정한 바를 준수하여, 적법하게 개인정보를 처리하고
              안전하게 관리하고 있습니다. 이에 「개인정보 보호법」 제30조에 따라
              정보주체에게 개인정보 처리에 관한 절차 및 기준을 안내하고, 이와
              관련한 고충을 신속하고 원활하게 처리할 수 있도록 하기 위하여
              다음과 같이 개인정보 처리방침을 수립·공개합니다.
            </p>

            <h4>개인정보의 처리목적</h4>
            <p>
              모그는 다음의 목적을 위하여 개인정보를 처리합니다. 처리하고
              있는 개인정보는 다음의 목적 이외의 용도로는 이용되지 않으며, 이용
              목적이 변경되는 경우에는 「개인정보 보호법」 제18조에 따라 별도의
              동의를 받는 등 필요한 조치를 이행할 예정입니다.
            </p>
            <p>
              <b>1. 회원 가입 및 관리</b><br/>
              회원 가입의사 확인, 회원제 서비스 제공에 따른
              본인 식별·인증, 회원자격 유지·관리, 서비스 부정이용 방지, 각종
              고지·통지 목적으로 개인정보를 처리합니다.
            </p>
            <p>
              <b>2. 재화 또는 서비스 제공</b><br/>
              서비스 제공, 계약서·청구서
              발송, 콘텐츠 제공, 맞춤서비스 제공, 본인인증, 요금
              결제·정산의 목적으로 개인정보를 처리합니다.
            </p>

            <h4>개인정보의 처리 및 보유기간</h4>
            <p>
              모그는 법령에 따른 개인정보 보유·이용기간 또는 정보주체로부터
              개인정보를 수집 시에 동의 받은 개인정보 보유·이용기간 내에서
              개인정보를 처리·보유합니다.
            </p>
            <p>각각의 개인정보 처리 및 보유 기간은 다음과 같습니다.</p>
            <p>
              <b>1. 홈페이지 회원 가입 및 관리</b> : 사업자/단체 홈페이지 탈퇴 시까지
            </p>
            <p>
              <b>2. 재화 또는 서비스 제공</b> : 재화·서비스 공급완료 및 요금결제·정산
              완료시까지 다만, 다음의 사유에 해당하는 경우에는 해당 기간 종료
              시까지
            </p>
            <p>
              「전자상거래 등에서의 소비자 보호에 관한 법률」에 따른 표시·광고, 계약내용 및 이행 등 거래에 관한 기록<br/>
              - 표시·광고에 관한 기록 : 6개월<br/>
              - 계약 또는 청약철회, 대금결제, 재화 등의 공급기록 : 5년 <br/>
              - 소비자 불만 또는 분쟁처리에 관한 기록 : 3년
            </p>
                


            <h4>처리하는 개인정보 항목</h4>
            <p>
              모그는 다음의 개인정보 항목을 처리하고 있습니다. 
            </p>
            <p>회원 가입 및 관리 : 성명, 생년월일, 주소, 전화번호, 이메일주소</p>

            <h4>개인정보의 처리목적, 수집 항목, 보유 및 이용기간</h4>
            <p>
              모그는 다음과 같이 정보주체의 개인정보를 처리합니다. 서비스
              수집 목적 수집 항목 보유 및 이용기간 회원 가입의사 확인, 회원제
              서비스 제공에 따른 본인 식별·인증, 회원자격 유지·관리, 서비스
              부정이용 방지, 각종 고지·통지, 성명,
              생년월일, 주소, 전화번호, 이메일주소 서비스 제공, 계약서·청구서
              발송, 콘텐츠 제공, 맞춤서비스 제공, 본인인증, 
              요금결제·정산, 과거 구매내역 회원 가입 및 관리 
              · · · 회원 탈퇴시까지 
            </p>
            <p>※ 단, 관계 법령 위반에 따른 수사, 조사 등이 진행 중인
              경우에는 해당 수사, 조사 종료시 까지 재화·서비스 공급완료 및
              요금결제·정산 완료시까지 </p>
            <p>※ 단, 관계 법령에 따라 파기하지 않고
              보존하여야 하는 경우에는 해당 기간까지</p>

            <h4>개인정보의 파기 절차 및 방법</h4>
            <p>
              1. 모그는 개인정보 보유기간의 경과, 처리목적 달성 등 개인정보가
              불필요하게 되었을 때에는 지체없이 해당 개인정보를 파기합니다.
            </p>
            <p>
              2. 정보주체로부터 동의받은 개인정보 보유기간이 경과하거나
              처리목적이 달성되었음에도 불구하고 다른 법령에 따라 개인정보를
              계속 보존하여야 하는 경우에는, 해당 개인정보를 별도의 데이터
              베이스(DB)로 옮기거나 보관장소를 달리하여 보존합니다.
            </p>
            <p>
              3. 개인정보 파기의 절차 및 방법은 다음과 같습니다.  
            </p>

              <p>1. 파기절차
              모그는 파기 사유가 발생한 개인정보를 선정하고, 모그의 개인 정보
              보호책임자의 승인을 받아 개인정보를 파기합니다.</p>
              <p>2. 파기방법
              모그는 전자적 파일 형태로 기록·저장된 개인정보는 기록을 재생할
              수 없도록 파기하며, 종이 문서에 기록·저장된 개인정보는 분쇄기로
              분쇄하거나 소각하여 파기합니다.</p>

          </Content>
        </Container>
      </Section>
    </Layout>
  );
};
export default Privacy;

const Section = styled.section`
  min-height: 90vh;
`;
const Container = styled.div`
  width: 1000px;
  margin: 0 auto;
  > h6 {
    padding: 50px 0 10px;
    font-size: 1.2rem;
    color: #333;
  }
  > p {
    line-height: 1.8;
  }
  @media (max-width: 1279px) {
    width: 100%;
    padding: 50px 1.5rem 0;
  }
`;
const Title = styled.h2`
  font-size: 2.8rem;
  line-height: 1.2em;
  letter-spacing: -0.4px;
  font-weight: 700;
  margin-bottom: 2rem;
  @media (max-width: 767px) {
    font-size: 2.25rem;
  }
`;
const Content = styled.div`
  > h4 {
    margin: 3rem 0 1rem;
    font-size: 1.2rem;
  }
  > p {
    line-height: 1.8;
  }
  > ul {
    margin: 1.6rem;
    > li {
      line-height: 1.8;
      position: relative;
      &::before {
        position: absolute;
        content: "";
        width: 3px;
        height: 3px;
        background: #000;
        display: block;
        left: -10px;
        top: 13px;
      }
    }
  }
`;
